In [0]:
import pandas as pd

In [7]:
arquivo = '../content/drive/My Drive/Temp/salarios2.csv'
df = pd.read_csv(arquivo)
df.head()

             Full Name            Position Title  ... Monthly Salary  Daily Salary
0      AARON,  ELVIA J          WATER RATE TAKER  ...        7413.75        243.74
1    AARON,  JEFFERY M            POLICE OFFICER  ...        6731.50        221.31
2       AARON,  KARINA            POLICE OFFICER  ...        6731.50        221.31
3  AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  ...        7065.00        232.27
4  ABAD JR,  VICENTE M         CIVIL ENGINEER IV  ...        8728.00        286.95

[5 rows x 6 columns]

---
### **Resumo**

In [8]:
df.describe()

       Annual Salary  Monthly Salary  Daily Salary
count   32181.000000    32181.000000  32181.000000
mean    79167.525846     6597.293754    216.896701
std     24462.356640     2038.529689     67.020052
min         0.960000        0.080000      0.000000
25%     69888.000000     5824.000000    191.470000
50%     83616.000000     6968.000000    229.080000
75%     91764.000000     7647.000000    251.410000
max    260004.000000    21667.000000    712.340000

In [9]:
df.describe(percentiles=[.20,.40,.60,.80])

       Annual Salary  Monthly Salary  Daily Salary
count   32181.000000    32181.000000  32181.000000
mean    79167.525846     6597.293754    216.896701
std     24462.356640     2038.529689     67.020052
min         0.960000        0.080000      0.000000
20%     65946.000000     5495.500000    180.670000
40%     80778.000000     6731.500000    221.310000
50%     83616.000000     6968.000000    229.080000
60%     86520.000000     7210.000000    237.040000
80%     93745.600000     7812.130000    256.840000
max    260004.000000    21667.000000    712.340000

In [10]:
df['Full Name'].describe()

count                32181
unique               31893
top       RIVERA,  RICARDO
freq                     4
Name: Full Name, dtype: object

---
### **Funções básicas**

In [11]:
df.mean()

Annual Salary     79167.525846
Monthly Salary     6597.293754
Daily Salary        216.896701
dtype: float64

In [12]:
df['Annual Salary'].quantile(.50) #percentile

83616.0

In [13]:
df[['Monthly Salary','Annual Salary']].median()

Monthly Salary     6968.0
Annual Salary     83616.0
dtype: float64

In [15]:
df['Daily Salary'].cumsum() #soma cumulativa

0            243.74
1            465.05
2            686.36
3            918.63
4           1205.58
            ...
32177    6979184.29
32178    6979413.37
32179    6979650.41
32180    6979952.74
32181           NaN
Name: Daily Salary, Length: 32182, dtype: float64

---
### **Agregando funções**

In [14]:
# .agg monta um .describe customizado
# Inclusive com funções customizadas e importadas de outros módulos
def cust(column):
    return column.quantile(0.75)

df[['Monthly Salary','Annual Salary']].agg(['min','mean','max',cust])

      Monthly Salary  Annual Salary
min         0.080000       0.960000
mean     6597.293754   79167.525846
max     21667.000000  260004.000000
cust     7647.000000   91764.000000

---
### **Contando itens**

In [41]:
df['Department'].value_counts().head()

POLICE           13570
FIRE              4875
STREETS & SAN     2090
WATER MGMNT       1848
AVIATION          1344
Name: Department, dtype: int64

In [45]:
# Em % do total
df['Department'].value_counts(normalize=True).head()

POLICE           0.421677
FIRE             0.151487
STREETS & SAN    0.064945
WATER MGMNT      0.057425
AVIATION         0.041764
Name: Department, dtype: float64

In [54]:
cont = df['Department'].value_counts()
cont_cum = df['Department'].value_counts().cumsum()
cont_perc = df['Department'].value_counts(normalize=True) * 100
cont_perc_cum = df['Department'].value_counts(normalize=True).cumsum() * 100
df_conta = pd.DataFrame({'#':cont, '# cum':cont_cum, '%':cont_perc, '% cum':cont_perc_cum})
df_conta

                           #  # cum          %       % cum
POLICE                 13570  13570  42.167739   42.167739
FIRE                    4875  18445  15.148690   57.316429
STREETS & SAN           2090  20535   6.494515   63.810944
WATER MGMNT             1848  22383   5.742519   69.553463
AVIATION                1344  23727   4.176377   73.729841
TRANSPORTN              1200  24927   3.728908   77.458749
OEMC                    1135  26062   3.526926   80.985675
PUBLIC LIBRARY           951  27013   2.955160   83.940835
GENERAL SERVICES         924  27937   2.871259   86.812094
FAMILY & SUPPORT         679  28616   2.109941   88.922035
FINANCE                  560  29176   1.740157   90.662192
HEALTH                   555  29731   1.724620   92.386812
LAW                      425  30156   1.320655   93.707467
CITY COUNCIL             397  30553   1.233647   94.941114
BUILDINGS                257  30810   0.798608   95.739722
COMMUNITY DEVELOPMENT    212  31022   0.658774   96.398496
BUSINESS AFFAIRS         173  31195   0.537584   96.936080
BOARD OF ELECTION        111  31306   0.344924   97.281004
DoIT                     106  31412   0.329387   97.610391
MAYOR'S OFFICE            93  31505   0.288990   97.899382
IPRA                      83  31588   0.257916   98.157298
CITY CLERK                82  31670   0.254809   98.412107
PROCUREMENT               81  31751   0.251701   98.663808
CULTURAL AFFAIRS          79  31830   0.245486   98.909294
HUMAN RESOURCES           68  31898   0.211305   99.120599
ANIMAL CONTRL             67  31965   0.208197   99.328796
INSPECTOR GEN             54  32019   0.167801   99.496597
BUDGET & MGMT             43  32062   0.133619   99.630217
ADMIN HEARNG              39  32101   0.121190   99.751406
DISABILITIES              27  32128   0.083900   99.835307
TREASURER                 24  32152   0.074578   99.909885
HUMAN RELATIONS           17  32169   0.052826   99.962711
BOARD OF ETHICS            9  32178   0.027967   99.990678
POLICE BOARD               2  32180   0.006215   99.996893
LICENSE APPL COMM          1  32181   0.003107  100.000000